Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/death/before_a_death/power_of_attorney.html.txt.tmx
Source language: en
Languages: ga

source: • Register of enduring powers of attorney
ga: • Clár na cumhachtaí aturnae buaine

source: Power of attorney is a legal device in Ireland that can be set up by a person (the donor) during his/her life when he/she is in good mental health
ga: Is deis dhlíthiúil í Cumhacht Aturnae in Éirinn a fhéadfaidh duine (an deontóir) a shocrú le linn a s(h)aoil nuair atá sláinte mhaith intinne aige/aice

source: It allows another specially appointed person (the attorney) to take actions on the donor's behalf if he/she is absent, abroad or incapacitated through illness
ga: Ceadaíonn sé do dhuine eile atá ainmnithe go speisialta (An tAturnae) beart a dhéanamh ar son an deontóra má bhíonn sé/sí as láthair, thar lear nó míchumasaithe de bharr breoiteachta

source: The relevant legislation is the Powers of Attorney Act 1996 and the Enduring Powers of Attorney Regulations 1996 (SI No
ga: Is í an reachtaíocht ábhartha an tAcht um Chumhachtaí Aturnae,1996 agus na Rialacháin um Chumhachtaí Aturnae, 1996 (I.R. Uimh

source: 196/1996) as amended by SI No
ga: 196/1996) arna leasú ag I.R

source: Part 7 of the Assisted Decision-Making (Capacity) Act 2015 provides for new arrangements for those who wish to make an Enduring Power of Attorney
ga: Soláthraíonn Cuid 7 den Acht Chinnteoireacht Cuidithe (Cumas) 2015 maidir le socruithe nua dóibh siúd ar mian leo a dhéanamh Cumhacht Bhuan Aturnae

source: When the 2015 Act is commenced, no new Enduring Power of Attorneys will be created under the 1996 Act
ga: Nuair a bhíonn an tAcht 2015 cuireadh tús, ní bheidh cruthaíodh aon Cumhacht Bhuan Aturnae nua faoin Acht 1996

source: If someone in Ireland is mentally incapacitated (for example, because of illness, disability or a progressive degenerative illness), all of their assets and property are normally frozen and cannot be used by anyone else unless they are jointly owned or, someone has power of attorney to deal with their property or money
ga: Má tá duine éigin in Éirinn faoi mhíchumas intinne (mar shampla, mar a gheall ar bhreoiteacht, mhíchumas nó ghalar forásach meathlúcháin), de ghnáth déantar a gcuid sócmhainní agus maoine go léir a chalcadh agus ní féidir le héinne eile úsáid a bhaint astu ach amháin má tá comhúinéireacht orthu nó má tá Cumhacht Aturnae ag duine éigin chun déileáil lena gcuid maoine nó airgid

source: In a larger sense, power of attorney is just one of the legal arrangements that you can make during your lifetime, in the event you become incapacitated or unable to deal with your affairs
ga: Tá Cumhacht Aturnae, sa chiall níos leithne, ar cheann de na socruithe dlí is féidir leat a dhéanamh le linn do shaoil, sa chás go dtagann míchumas ort nó nach mbeidh tú in ann déileáil le do ghnóthaí

source: Information to help guide you in recording and registering your preferences in the event of emergency, serious illness or death is available at Thinkahead.ie, where you can also download the Think Ahead Form
ga: Tá eolas chun tú a threorú i do chuid sainroghanna a thaifeadadh agus a chlárú i gcás éigeandála, tinneas tromchúiseach nó ar bhás ar fáil ag Thinkahead.ie, áit ar féidir leat a íoslódáil chomh maith Fhoirm Think Ahead

source: Read more about the legal arrangements in the event of incapacity here
ga: Léigh tuilleadh faoi shocruithe dlí i gcás duine atá míchumasaithe anseo

source: There are two types of power of attorney allowed under Irish law:
ga: Tá dhá chineál Cumhachta Aturnae ceadaithe faoi dhlí na hÉireann

source: • Power of attorney which gives either a specific or a general power and ceases as soon as the donor becomes incapacitated
ga: • Cumhacht Ghinearálta Aturnae; a chríochnaíonn nuair atá an deontóir míchumasaithe agus,

source: • Enduring power of attorney which takes effect on the incapacity of the donor
ga: • Cumhacht Bhuan Aturnae; a thagann i bhfeidhm sa chás go bhfuil an deontóir míchumasaithe

source: Both cease on the death of the donor
ga: Tagann deireadh leis an bpéire seo ar bhás an deontóra

source: However, it may be difficult to prove that the donor is dead if his/her body cannot be found, for example, as in the case of a death by drowning
ga: D'fhéadfadh sé a bheith deacair a chruthú áfach go bhfuil an deontóir marbh, murar féidir teacht ar a c(h)orp, mar shampla i gcás báite

source: Once the body is found or the donor is declared to be "believed dead" by a court (usually after 7 years have passed), the power of attorney (if there was one) ends and their affairs are dealt with in the normal way by will or under intestacy law
ga: Chomh luath agus a fhaightear an corp nó a dhéantar fógra cúirte go nglactar leis go bhfuil an deontóir marbh (de ghnáth tar éis 7 mbliana) tagann deireadh leis an gCumhacht Aturnae (má bhí a leithéid ann) agus déileáiltear lena gcuid gnóthaí ar an ngnáthbhealach faoi uacht nó faoin dlí díthiomnachta

source: A power of attorney can be specific (limited to a particular purpose, for example, sale of your house in your absence) or general (entitling the attorney to do almost everything that you yourself could do)
ga: D’fhéadfadh cumhacht aturnae bheith sonrach (teoranta do chuspóir ar leith, mar shampla, díol do thí agus tú gan a bheith i láthair) nó cumhacht aturnae ginearálta (a thugann an teidlíocht don aturnae nach mór gach rud a dhéanamh a d’fhéadfá féin a dhéanamh)

source: For example, it may allow the attorney to take a wide range of actions on the donor's behalf in relation to property, business, and financial affairs
ga: Mar shampla, d’fhéadfadh sé ligean don aturnae dul i mbun réimse fairsing gníomhartha ar son an deontóra maidir le gnóthaí réadmhaoine, gnó agus airgeadais

source: He/she may make payments from the specified accounts, make appropriate provision for any specified person's needs, and make appropriate gifts to the donor's relations or friends
ga: Féadfaidh sé/sí íocaíochtaí a dhéanamh ó na cuntais shainithe, soláthar a dhéanamh do riachtanais aon duine sainithe, agus na bronntanais oiriúnacha a bhronnadh ar ghaolta nó ar chairde an deontóra

source: You do not require a solicitor to create a general power of attorney
ga: Ní theastaíonn aturnae uait chun cumhacht ghinearálta aturnae a chruthú

source: It can be created when signed either by you or at your direction and in the presence of a witness
ga: Féadtar é a chruthú nuair a shíníonn tú féin é nó nuair a shínítear é le d’ordú i láthair finné

source: However, it is advisable to get legal advice before you sign a form appointing someone else to manage your affairs
ga: Moltar duit comhairle dlí a fháil, áfach, sula síníonn tú foirm a cheapann duine eile chun do ghnóthaí a bhainistiú

source: You can appoint anyone you wish to be your attorney
ga: Féadfaidh tú aon duine a cheapadh is mian leat bheith mar d’aturnae

source: A form of general power of attorney is given in the Third Schedule of the Powers of Attorney Act 1996 (pdf)
ga: Tugtar cineál cumhacht ghinearálta aturnae sa Tríú Sceideal den Acht um Chumhachtaí Aturnae, 1996 (pdf)

source: An enduring power of attorney (EPA) also allows the attorney to make "personal care decisions" on the donor's behalf once he/she is no longer fully mentally capable of taking decisions themself
ga: Ceadaíonn Cumhacht Bhuan Aturnae don Aturnae chomh maith "cinneadh faoi chúram pearsanta" a dhéanamh ar son an deontóra nuair nach bhfuil sé/sí in ann cinneadh a dhéanamh é/í féin mar gheall ar chúinsí sláinte intinne

source: Personal care decisions may include deciding where and with whom the donor will live, who he/she should see or not see and what training or rehabilitation he/she should get
ga: Agus cinneadh ar chúram pearsanta á dhéanamh, d'fhéadfadh go mbeadh cinneadh le déanamh ar cé leis agus cén áit a bheidh an deontóir ina c(h)ónaí, cé hiad na daoine a mbeidh agus nach mbeidh sé/sí in ann a fheiceáil agus cén traenáil nó athshlánú ar chóir dó/di a fháil

source: However, if the donor wants, he/she can specifically exclude any of these powers when setting up the power of attorney or can make the attorney's powers subject to any reasonable conditions and restrictions
ga: Más mian leis an deontóir, áfach, is féidir leis/léi ceann ar bith de na cumhachtaí seo a eisiamh nuair atá an Chumhacht Aturnae á socrú nó is féidir leis/léi coinníollacha agus srianta réasúnta a chur i bhfeidhm maidir le cumhachtaí an Aturnae

source: You can appoint anyone you wish to be your attorney, including a spouse, civil partner, family member, friend, colleague, etc
ga: Is féidir leat duine ar bith is mian leat a cheapadh mar Aturnae agat, lena n-áirítear cara, duine den teaghlach, comhghleacaí, páirtí homaighnéasach nó leispiach srl

source: The procedure for creating an enduring power of attorney is much more complex than that for creating a general power of attorney
ga: Tá próiseas i bhfad níos casta i gceist má tá cumhacht bhuan aturnae á cur i gcrích

source: Creating an enduring power of attorney
ga: Cumhacht bhuan aturnae a chur i gcrích

source: Because the enduring power of attorney involves the transfer of considerable powers from you to another person, there are a number of legal safeguards to protect you from abuses
ga: Aistríonn cumhacht bhuan aturnae riar maith cumhachtaí uaitse chuig duine eile agus mar sin, tá roinnt cosaintí dlíthiúla ann chun tú a chosaint ó mhí-úsáid

source: The procedure for executing the enduring power of attorney is complex and requires the involvement of a solicitor and a doctor
ga: Tá an próiseas a bhaineann le cumhacht bhuan aturnae a chur i bhfeidhm casta agus tá gá le rannpháirtíocht aturnae agus dochtúra

source: The enduring power can only come into effect when certain procedures have been gone through and the courts have a general supervisory role in the implementation of the power
ga: Ní féidir leis an gcumhacht bhuan a theacht i bhfeidhm go dtí go bhfuil nósanna imeachta áirithe tugtha chun críche agus go bhfuil ról ginearálta maoirseachta ag na Cúirteanna maidir leis an gcumhacht a chur i bhfeidhm

source: The document creating the power must be in a particular format and must include the following:
ga: Caithfidh leagan amach áirithe a bheith ar an gcáipéis a chuireann an chumhacht i gcrích agus caithfidh na rudaí seo a leanas a bheith san áireamh ann:

source: • A statement by a doctor verifying that in his/her opinion you had the mental capacity at the time that the document was executed to understand the effect of creating the power
ga: • ráiteas ón dochtúir ag cur in iúl ina t(h)uairim go raibh an cumas intinne agat ag an am a cuireadh an cháipéis le chéile toradh chruthú na cumhachta a thuiscint

source: • A statement from you that you understood the effect of creating the power
ga: • ráiteas uait ag dearbhú gur thuig tú toradh chruthú na cumhachta

source: • A statement from a solicitor that he/she is satisfied that you understood the effect of creating the power of attorney
ga: • ráiteas ó aturnae go bhfuil sé/sí sásta gur thuig tú toradh chruthú chumhacht aturnae

source: • A statement from a solicitor that you were not acting under undue influence
ga: • ráiteas ó aturnae ag dearbhú nach raibh tú ag feidhmiú faoi thionchar míchuí

source: At least 2 people must be notified of the making of an EPA, none of whom will be the attorney
ga: Ní mór ar a laghad beirt daoine a chur ar an eolas faoi CCA a dhéanamh, ní bheidh an t-aturnae ina measc

source: One of the notice parties must be your spouse or civil partner if living with you
ga: Ní mór go mbeidh duine de na páirtithe fógra do chéile nó do pháirtnéir sibhialta má chónaíonn siad leat

source: If this does not apply, one of your notice parties must be your child
ga: Murab infheidhme dó seo, ní mór go mbeidh do leanbh i measc do pháirtithe fógra

source: If neither is applicable, one of the notice parties must be any relative (that is parent, sibling, grandchild, widow/widower/surviving civil partner of child, nephew or niece)
ga: Murab infheidhme do cheachtar díobh, ní mór go mbeidh duine de na páirtithe fógra aon ghaol leat (is é sin, tuismitheoir, siblíneach, garmhac/gariníon, baintrí/baintreach fir/páirtnéir sibhialta linbh, neacht nó nia)

source: Who cannot be appointed?
ga: Cé nach féidir a cheapadh?

source: An enduring power of attorney may be granted to individuals or trust corporations but may not be granted to the following people:
ga: Is féidir cumhacht bhuan aturnae a thabhairt do dhaoine aonair nó do chorparáidí iontaobhais ach ní féidir í a thabhairt do na daoine seo a leanas:

source: • People under the age of 18
ga: • daoine nach bhfuil 18 mbliana d'aois bainte amach acu

source: • People convicted of offences involving fraud or dishonesty
ga: • daoine a ciontaíodh i gcionta a bhain le calaois nó mí-ionracas

source: • People disqualified under the Companies Acts
ga: • daoine atá dícháilithe faoi Achtanna na gCuideachtaí

source: • An individual or trust corporation who owns a nursing home in which you live or an employee or agent of the owner, unless that person is also your spouse, civil partner, child or sibling
ga: • duine aonair nó corparáid iontaobhais ar leo teach altranais ina bhfuil tú i do chónaí nó fostaí nó ionadaí an úinéara, ach amháin sa chás gur do chéile nó páirtnéir sibhialta, do pháiste, do dheartháir nó do dheirfiúr é/í

source: The EPA can only come into force when it has been registered
ga: Ní bheidh feidhm ag an CCA ach amháin tar éis dó bheith cláraithe

source: However, once an application to register the EPA has been made, the attorney may take action under the EPA's powers to maintain you and prevent loss to your estate
ga: Áfach, a luaithe a dhéantar iarratas ar an CCA a chlárú, féadfaidh an t-aturnae dul i mbun gníomhaíochta faoi chumhachtaí an CCA chun tú féin a chaomhnú agus chun caillteanas ar d’eastát a chosc

source: The attorney may also take action to maintain themself and other persons, in so far as it is permitted under Section 6 (4) of the 1996 Act
ga: Ina theannta sin, féadfaidh an t-aturnae dul i mbun gníomhaíochta chun iad féin agus daoine eile a chaomhnú, sa mhéid go gceadaítear amhlaidh a dhéanamh faoi Alt 6 (4) d’Acht 1996

source: The attorney may also make any personal care decisions permitted under the powers that cannot reasonably be deferred until the application for registration has been determined
ga: Sa mhullach air sin, féadfaidh an t-aturnae aon chinntí faoi chúram pearsanta a dhéanamh a cheadaítear faoi na cumhachtaí nach féidir a iarchur go réasúnta nó go ndeimhnítear an t-iarratas ar chlárú

source: Also, in certain circumstances before the EPA is registered, application may be made to the court to exercise the EPA's powers under Section 12 of the Act
ga: Anuas air sin, faoi chúinsí áirithe, sula gcláraítear an CCA, féadtar iarratas a dhéanamh ar an gcúirt chun cumhachtaí CCA a fheidhmiú faoi Alt 12 den Act

source: In order to register an EPA, the future attorney makes an application for registration to the Registrar of Wards of Court, once there is reason to believe that you are or are becoming mentally incapable
ga: D’fhonn CCA a chlárú, déanann an t-aturnae amach anseo iarratas ar chlárú le Cláraitheoir na gCoimircí Cúirte, a luaithe nach ann d’aon údar lena gcreidiúint go bhfuil tú neamhabálta go meabhrach nó go bhfuil tú ag éirí neamhabálta go meabhrach

source: The attorney must have a medical certificate confirming that you are incapable of managing your affairs
ga: Ní mór go mbeidh ag an aturnae teastas leighis a dhearbhaíonn nach bhfuil tú ábalta do chuid gnóthaí a bhainistiú

source: Five weeks before making this application, the attorney must notify you and the notice parties of his/her intention to do so
ga: Ní mór don aturnae thú agus na páirtithe fógra a chur ar an eolas, cúig seachtaine sula ndéantar an t-iarratas seo, go bhfuil sé beartaithe aige/aici amhlaidh a dhéanamh

source: Within the 5 weeks, the donor or a notice party can lodge a notice of objection on one of the grounds given in Section 10 (3) of the Act with the Registrar of Wards of Court
ga: Laistigh de na cúig seachtaine, féadfaidh an deontóir nó páirtí fógra agóide a sheoladh ar cheann de na húdair a luaitear in Alt 10 (3) den Acht le Cláraitheoir na gCoimircí Cúirte

source: The High Court has an extensive supervisory role in respect of the EPA
ga: Tá ról leathan maoirseoireachta ag an gcúirt maidir leis an gCumhacht Bhuan Aturnae

source: Among other things, the court has power to give directions about the management and disposal of your property
ga: I measc rudaí eile, tá cumhacht ag an gcúirt treoracha a thabhairt maidir le bainistíocht agus riaradh do mhaoine

source: The court may confirm the revocation of a power of attorney if it is satisfied that you were mentally competent to revoke it
ga: Féadfaidh an chúirt cúlghairm de chumhacht aturnae a dhaingniú má tá sí sásta go bhfuil an ábaltacht intinne agat chun é a chúlghairm

source: The court can order cancellation of the power where it is satisfied that:
ga: Is féidir leis an gcúirt cealú na cumhachta a ordú má tá sí sásta faoi na nithe seo a leanas:

source: • You are mentally capable and likely to remain so
ga: • go bhfuil cumas intinne agat agus gur cosúil gur mar sin a fhanfaidh tú

source: • The attorney is unsuitable
ga: • nach bhfuil an t-aturnae feiliúnach

source: • Fraud or undue pressure was used to induce you to create the power
ga: • gur baineadh leas as calaois nó brú míchuí ag cur ina luí ort an chumhacht a chruthú

source: Scope of authority of an enduring power of attorney
ga: Scóip an údaráis atá ag Cumhacht Bhuan Aturnae

source: The EPA may give general authority to the attorney to do anything that the attorney might lawfully do or it may merely give authority to do specific acts on your behalf
ga: Féadfaidh an Chumhacht Bhuan Aturnae údarás ginearálta a thabhairt don aturnae aon rud dlíthiúil gur mian leis/ léi a dhéanamh nó féadfaidh sé an t-údarás a thabhairt dó/di gníomhachtaí faoi leith a dhéanamh ar do shon

source: The attorney may make certain personal care decisions - these must be made in your best interests, must be in accordance with what you would have been likely to do and the attorney must consult family members and carers in making these decisions
ga: Is féidir leis an aturnae cinntí faoi do chúram pearsanta a dhéanamh -ní mór don aturnae iad a dhéanamh ar do leas is fearr, de réir an rud ba mhian leat a dhéanamh agus ní mór don aturnae dul i gcomhairle le do theaghlach agus cúramóirí agus na cinntí seo á ndéanamh aige

source: The attorney is considered to be acting in your best interests if he/she reasonably believes that what he/she decides is in your best interests
ga: Meastar go bhfeidhmíonn an t-aturnae chun do bharrleasa má chreideann sé/sí go réasúnta go bhfuil a gcinneann sé/sí chun do bharrleasa

source: A personal care decision is a decision concerning one or more of the following:
ga: Cinneadh a bhaineann le ceann nó níos mó de na nithe seo a leanas is ea cinneadh faoi chúram pearsanta:

source: • Where and with whom you should live
ga: • cén áit agus cé leis a mbeidh tú i do chónaí

source: • Whom you should see and not see
ga: • cé hiad na daoine a mbeidh agus nach mbeidh tú in ann a fheiceáil

source: • What training and rehabilitation you should get
ga: • cén traenáil agus athshlánú ar chóir duit a fháil

source: • Your diet and dress
ga: • do bhia agus do chuid éadaí

source: • Inspection of your personal papers
ga: • cigireacht ar do cháipéisí pearsanta

source: • Housing, social welfare and other benefits
ga: • tithíocht, liúntais leasa shóisialaigh agus sochair eile

source: The list does not include health care decisions, although the borderline between personal care and health care decisions is not always clear
ga: Níl cinntí faoi chúram sláinte san áireamh ar an liosta, cé go bhfuil sé deacair uaireanta idirdhealú a dhéanamh idir cinntí faoi chúram sláinte agus chúram pearsanta

source: However, it seems clear that the attorney does not have the power to make a decision as to whether or not a person suffering from dementia should undergo surgery
ga: Is cosúil, áfach nach bhfuil an chumhacht ag an aturnae cinneadh a dhéanamh ar cheart nó nár cheart don duine a bhfuil míchumas intinne air/uirthi dul faoi scian

source: Revocation of an enduring power of attorney
ga: Cúlghairm cumhacht chomhsheasmhach aturnae

source: The donor can revoke an EPA at any time before an application is made to register it
ga: Féadfaidh an deontóir CCA a chúlghairm ag aon tráth sula ndéantar iarratas chun é a chlárú

source: Once the EPA has been registered you cannot revoke it even if you are, for the time being, mentally capable
ga: A luaithe a cláraíodh an CCA, ní féidir leat é a chúlghairm, fiú má bhíonn tú, do thuras an ama, ábalta go meabhrach

source: To revoke it, you would have to apply to the court and the court approve the revocation
ga: Chun é a chúlghairm, bheadh ort iarratas a dhéanamh ar an gcúirt agus bheadh ar an gcúirt an chúlghairm a fhaomhadh

source: Termination of an enduring power of attorney
ga: Foirceannadh cumhacht chomhsheasmhach aturnae

source: An EPA ceases on the death of the donor
ga: Cuirtear deireadh le CCA ar bhás don deontóir

source: However, there are other circumstances in which an EPA ceases to have effect
ga: Is ann do chúinsí eile, áfach, faoina gcuirtear deireadh le héifeacht CCA

source: For example, where a spouse or civil partner is the attorney, the EPA ceases where:
ga: Mar shampla, sa chás gur céile nó páirtnéir sibhialta an t-aturnae, cuirtear deireadh leis an CCA:

source: • The marriage/civil partnership no longer exists due to annulment, divorce or dissolution
ga: • Murab ann don phósadh/pháirtnéireacht shibhialta a thuilleadh mar gheall ar neamhniú, ar cholscaradh nó ar dhíscaoileadh

source: • A judicial separation is granted or the couple enter into a separation agreement
ga: • Deonaítear scaradh breithiúnach nó iontrálann an lánúin isteach i gcomhaontú scartha

source: • A protection, barring or similar order is made on the application of either spouse/civil partner
ga: • Déantar ordú cosanta, urchoisc nó ordú dá mhacasamhail ar iarratas na céile/an pháirtnéara shibhialta

source: An EPA ceases where the attorney becomes one of the people listed above who cannot be granted enduring powers of attorney
ga: Cuirtear deireadh le CCA nuair a bhíonn an t-aturnae i measc na ndaoine a liostaítear thuas nach féidir cumhachtaí comhsheasmhacha a bhronnadh air/uirthi

source: The court can make an order cancelling an EPA where, for example, it finds the attorney is unsuitable
ga: Féadfaidh an chúirt ordú a dhéanamh a chuireann an CCA ar ceal, mar shampla, má dheimhnítear go bhfuil an t-aturnae neamhoiriúnach

source: Register of enduring powers of attorney
ga: Clár na cumhachtaí aturnae buaine

source: The Office of Wards of Court maintains a register of EPA instruments which have been registered in the office
ga: Coinníonn an Oifig na gCoimircithe Cúirte clár na n-ionstraimí CCA atá cláraithe san oifig

source: The register can be viewed by the public for free
ga: Is féidir an clár a fheiceáil ag an bpobal saor in aisce

source: A fee of €15 is payable if you wish to take a copy of an entry in the register
ga: Tá táille €15 iníoctha más mian leat cóip de thaifead sa chlár a ghlacadh

source: Office of Wards of Court
ga: Cláraitheoir Coimircí na gCúirteanna

source: Tel:+353 (0)1 888 6189
ga: Teil:+353 (0)1 888 6189
